In [7]:
# 处理缺失数据
import pandas as pd
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [32]:
#将缺失值表示为 NA
string_data[0] = None#Python 内置的 None 值在对象数组中也可以作为 NA

In [33]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [34]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [35]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [36]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [37]:
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [38]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [39]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [40]:
data[4] = NA

In [41]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [42]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [43]:
df = pd.DataFrame(np.random.randn(7, 3))

In [44]:
df.iloc[:4, 1] = NA

In [45]:
df.iloc[:2, 2] = NA

In [46]:
df

          0         1         2
0 -0.287769       NaN       NaN
1  0.463930       NaN       NaN
2  0.595689       NaN  0.582149
3  1.060007       NaN  0.917274
4 -1.533122 -0.169736 -0.009099
5  0.308635  0.643079  1.023105
6 -0.789453  0.576045  1.009088

In [47]:
df.dropna()

          0         1         2
4 -1.533122 -0.169736 -0.009099
5  0.308635  0.643079  1.023105
6 -0.789453  0.576045  1.009088

In [48]:
df.dropna(thresh=2)

          0         1         2
2  0.595689       NaN  0.582149
3  1.060007       NaN  0.917274
4 -1.533122 -0.169736 -0.009099
5  0.308635  0.643079  1.023105
6 -0.789453  0.576045  1.009088

In [49]:
df.fillna(0)

          0         1         2
0 -0.287769  0.000000  0.000000
1  0.463930  0.000000  0.000000
2  0.595689  0.000000  0.582149
3  1.060007  0.000000  0.917274
4 -1.533122 -0.169736 -0.009099
5  0.308635  0.643079  1.023105
6 -0.789453  0.576045  1.009088

In [50]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.287769  0.500000  0.000000
1  0.463930  0.500000  0.000000
2  0.595689  0.500000  0.582149
3  1.060007  0.500000  0.917274
4 -1.533122 -0.169736 -0.009099
5  0.308635  0.643079  1.023105
6 -0.789453  0.576045  1.009088

In [51]:
_ = df.fillna(0, inplace=True)

In [52]:
df

          0         1         2
0 -0.287769  0.000000  0.000000
1  0.463930  0.000000  0.000000
2  0.595689  0.000000  0.582149
3  1.060007  0.000000  0.917274
4 -1.533122 -0.169736 -0.009099
5  0.308635  0.643079  1.023105
6 -0.789453  0.576045  1.009088

In [53]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA 
df

          0        1         2
0  0.937978 -1.48690  0.504684
1  2.038022 -0.71188 -0.918484
2 -0.336318      NaN  0.550304
3  0.246116      NaN  1.934958
4 -0.338333      NaN       NaN
5 -0.756406      NaN       NaN

In [54]:
df.fillna(method='ffill')

          0        1         2
0  0.937978 -1.48690  0.504684
1  2.038022 -0.71188 -0.918484
2 -0.336318 -0.71188  0.550304
3  0.246116 -0.71188  1.934958
4 -0.338333 -0.71188  1.934958
5 -0.756406 -0.71188  1.934958

In [55]:
df.fillna(method='ffill', limit=2)

          0        1         2
0  0.937978 -1.48690  0.504684
1  2.038022 -0.71188 -0.918484
2 -0.336318 -0.71188  0.550304
3  0.246116 -0.71188  1.934958
4 -0.338333      NaN  1.934958
5 -0.756406      NaN  1.934958

In [56]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [57]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [58]:
# 数据转换
# 移除重复数据

In [59]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [60]:
# DataFrame 的 duplicated 方法返回一个布尔型 Series，
# 表示各行是否是重复行（前面出现过的行）
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [61]:
# drop_duplicates 方法，会返回一个 DataFrame，重复的数组会标为 False
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [62]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [63]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [64]:
# 利用函数或映射进行数据转换
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 
                              'Pastrami', 'corned beef', 'Bacon', 
                              'pastrami', 'honey ham', 'nova lox'], 
                              'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [65]:
meat_to_animal = {   'bacon': 'pig',   
                  'pulled pork': 'pig',  
                  'pastrami': 'cow',  
                  'corned beef': 'cow',  
                  'honey ham': 'pig',  
                  'nova lox': 'salmon' }

In [66]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [67]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [68]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [69]:
# 替换值 
data = pd.Series([1., -999., 2., -999., -1000., 3.])
#-999 这个值可能是一个表示缺失数据的标记值。
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [70]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [71]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [72]:
# 可以传递一个替换列表
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [73]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [74]:
# 重命名轴索引
data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [75]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [76]:
#将其赋值给 index，这样就可以对 DataFrame 进行就地修改
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [77]:
# 创建数据集的转换版（不是修改原始数据）
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [78]:
# rename 可以结合字典型对象实现对部分轴标签的更新
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [79]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [80]:
# 离散化和面元划分
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [81]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [82]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [83]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [84]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [85]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [86]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [87]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.29, 0.52], (0.74, 0.97], (0.061, 0.29], (0.74, 0.97], (0.29, 0.52], ..., (0.061, 0.29], (0.29, 0.52], (0.29, 0.52], (0.74, 0.97], (0.74, 0.97]]
Length: 20
Categories (4, interval[float64]): [(0.061, 0.29] < (0.29, 0.52] < (0.52, 0.74] < (0.74, 0.97]]

In [88]:
data = np.random.randn(1000)  # 正常分布
cats = pd.qcut(data, 4)  # 1/4
cats

[(0.0369, 0.716], (-3.042, -0.702], (-3.042, -0.702], (-3.042, -0.702], (-3.042, -0.702], ..., (0.0369, 0.716], (0.716, 3.279], (0.716, 3.279], (0.0369, 0.716], (-0.702, 0.0369]]
Length: 1000
Categories (4, interval[float64]): [(-3.042, -0.702] < (-0.702, 0.0369] < (0.0369, 0.716] < (0.716, 3.279]]

In [89]:
pd.value_counts(cats)

(0.716, 3.279]      250
(0.0369, 0.716]     250
(-0.702, 0.0369]    250
(-3.042, -0.702]    250
dtype: int64

In [90]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0369, 1.307], (-1.331, 0.0369], (-3.042, -1.331], (-1.331, 0.0369], (-3.042, -1.331], ..., (0.0369, 1.307], (1.307, 3.279], (1.307, 3.279], (0.0369, 1.307], (-1.331, 0.0369]]
Length: 1000
Categories (4, interval[float64]): [(-3.042, -1.331] < (-1.331, 0.0369] < (0.0369, 1.307] < (1.307, 3.279]]

In [92]:
# 检测和过滤异常值
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.004033     0.025026    -0.025663     0.033355
std       0.965683     0.992877     0.966177     0.976610
min      -3.262478    -3.038965    -3.440712    -2.846379
25%      -0.655577    -0.625746    -0.629501    -0.590840
50%      -0.040904     0.007496    -0.032268    -0.000206
75%       0.658279     0.661891     0.619206     0.686097
max       4.120138     3.274903     3.908081     3.087324

In [93]:
col = data[2]
col[np.abs(col) > 3]

131   -3.386029
192    3.908081
541   -3.440712
Name: 2, dtype: float64

In [94]:
data[(np.abs(data) > 3).any(1)] #选出全部含有“超过 3 或－3 的值”的行

            0         1         2         3
131 -1.868514  0.115213 -3.386029  0.332657
192 -0.320247  0.505288  3.908081 -0.514350
200  1.367911  1.146961  1.583079  3.087324
205 -0.166522  3.274903  0.006452 -2.026085
249  0.043202  3.064100  1.464767 -0.844918
261  0.486530  3.040366  0.697331 -0.510862
441  3.530405  2.326418  0.358846  0.088161
480 -3.262478  1.123064  0.350535 -0.096959
541 -0.859143  1.923838 -3.440712  0.659413
559  3.022707  1.419008 -0.077520 -0.533165
695  1.329980 -3.038965 -0.164183  0.190824
739 -1.139582 -3.006273 -1.228249 -0.416130
976  4.120138 -1.188991 -0.289311 -0.595098

In [95]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.005443     0.024692    -0.025744     0.033268
std       0.958800     0.991559     0.960159     0.976341
min      -3.000000    -3.000000    -3.000000    -2.846379
25%      -0.655577    -0.625746    -0.629501    -0.590840
50%      -0.040904     0.007496    -0.032268    -0.000206
75%       0.658279     0.661891     0.619206     0.686097
max       3.000000     3.000000     3.000000     3.000000

In [96]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0  1.0
1  1.0  1.0 -1.0  1.0
2 -1.0  1.0  1.0  1.0
3  1.0 -1.0 -1.0 -1.0
4 -1.0  1.0  1.0  1.0

In [98]:
# 排列和随机采样
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([4, 3, 1, 2, 0])

In [99]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [100]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3

In [101]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
0   0   1   2   3

In [102]:
choices = pd.Series([5, 7, -1, 6, 4])

In [103]:
draws = choices.sample(n=10, replace=True)
draws

1    7
2   -1
1    7
2   -1
1    7
3    6
0    5
1    7
2   -1
4    4
dtype: int64

In [104]:
# 计算指标/哑变量
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [112]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies) 
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [115]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::', 
                       header=None, names=mnames,engine='python')
#加上engine='python'可以避免正则表达式分隔符的警告信息
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [116]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [117]:
genres = pd.unique(all_genres)

In [118]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [119]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [120]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [121]:
gen = movies.genres[0]

In [122]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [123]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [124]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [125]:
movies_windic = movies.join(dummies.add_prefix('Genre_')) 
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [126]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [127]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [128]:
# 字符串操作
val = 'a,b,  guido' 
val.split(',')

['a', 'b', '  guido']

In [130]:
# split 常常与 strip 一起使用，以去除空白符（包括换行符）
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [131]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [132]:
'::'.join(pieces)

'a::b::guido'

In [133]:
'guido' in val

True

In [134]:
val.index(',')

1

In [135]:
val.find(':')

-1

In [137]:
val.index('b')
# 注意 find 和 index 的区别：
# 如果找不到字符串，index 将会引发一个异常（而不是返回－1）
# val.index(':')

2

In [138]:
val.count(',')

2

In [139]:
val.replace(',', '::')

'a::b::  guido'

In [140]:
val.replace(',', '')

'ab  guido'

In [141]:
# 正则表达式 
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [142]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [143]:
regex.findall(text)

['    ', '\t ', '  \t']

In [145]:
text = """Dave dave@google.com 
        Steve steve@gmail.com 
        Rob rob@gmail.com 
        Ryan ryan@yahoo.com """ 
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}' 
# re.IGNORECASE 不区分大小写 
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [146]:
m = regex.search(text)
m

In [147]:
text[m.start():m.end()]

'dave@google.com'

In [148]:
print(regex.match(text))

None

In [150]:
print(regex.sub('REDACTED', text))

Dave REDACTED
        Steve REDACTED
        Rob REDACTED
        Ryan REDACTED

In [151]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [152]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [153]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [154]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
        Steve Username: steve, Domain: gmail, Suffix: com
        Rob Username: rob, Domain: gmail, Suffix: com
        Ryan Username: ryan, Domain: yahoo, Suffix: com

In [155]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [156]:
data = pd.Series(data)
data

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [157]:
data.isnull()

Dave     False
Rob      False
Steve    False
Wes       True
dtype: bool

In [158]:
data.str.contains('gmail')

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object

In [159]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [160]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Rob        [(rob, gmail, com)]
Steve    [(steve, gmail, com)]
Wes                        NaN
dtype: object

In [161]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Rob      True
Steve    True
Wes       NaN
dtype: object

In [162]:
matches.str.get(1)

Dave    NaN
Rob     NaN
Steve   NaN
Wes     NaN
dtype: float64

In [163]:
matches.str[0]

Dave    NaN
Rob     NaN
Steve   NaN
Wes     NaN
dtype: float64

In [164]:
data.str[:5]

Dave     dave@
Rob      rob@g
Steve    steve
Wes        NaN
dtype: object